/**
 * 
 */
package test8;

/**
 * @author 日暮れて道遠し
 *
 */
public class HomeWork345 {
	public static void main(String[] args) {
//	4．通过继承实现员工工资核算打印功能
//父类：员工类（ Employee )
//	子类：部门经理类（ Manager )、普通员工类（ Worker )
//	(1）部门经理工资＝1000＋单日工资＊天数＊等级（1.2)。=>奖金+基本工资(2）普通员工工资＝单日工资＊天数＊等级（1.0);=>基本工资
//	(3)员工属性：姓名，单日工资，工作天数
//	(4）员工方法（打印工资）
//	(5）普遍员工及部门经理都是员工子类，需要重写打印工资方法。
//	(5)定义并初始化普通员工对象，调用打印工资方法输出工资，定义并初始化部门经理对象◇调用打印工资方法输出工资
//	自己一定要独立写一遍
		HomeEmployee345 e1 = new HomeManager345("张三", 150, 30, 1.2, 1000);
		HomeEmployee345 e2 = new HomeWorker345("李四", 150, 30,1.0);
		e1.salary();
		e2.salary();
		
		
	}
}
